app/Views/master/mcustomer_v.php

SELECT *
FROM `customer`
ORDER BY `customer_name` ASC
---
                                </thead>
                                <tbody>
                                    <?php
                                    $usr = $this->db
                                        ->table("customer")
                                        ->orderBy("customer_name", "ASC")
                                        ->get();