app/Views/master/mproduct_v.php

SELECT *
FROM `category`
WHERE `store_id` = '0'
ORDER BY `category_name` ASC
---
                                    <label class="control-label col-sm-2" for="category_id">Category:</label>
                                    <div class="col-sm-10">
                                        <?php
                                        $category = $this->db->table("category")
                                            ->where("store_id", session()->get("store_id"))
                                            ->orderBy("category_name", "ASC")
                                            ->get();

SELECT *
FROM `unit`
WHERE `store_id` = '0'
ORDER BY `unit_name` ASC
---
                                    <label class="control-label col-sm-2" for="unit_id">Unit:</label>
                                    <div class="col-sm-10">
                                        <?php
                                        $unit = $this->db->table("unit")
                                            ->where("store_id", session()->get("store_id"))
                                            ->orderBy("unit_name", "ASC")
                                            ->get();