app/Views/transaction/sewa_v.php

                                    <div class="col-sm-10">
                                        <select class="form-control select" id="customer_id" name="customer_id">
                                            <option value="" <?= ($customer_id == "") ? "selected" : ""; ?>>Pilih Customer</option>
                                            <?php $customer = $this->db->table("customer")->orderBy("customer_name")->get();
---
SELECT *
FROM `customer`
ORDER BY `customer_name`

                                            <div class="col-sm-5 p-1">
                                                <select onchange="isinominal()" class="form-control select" id="product_id" name="product_id">
                                                    <option value="">Pilih Product</option>
                                                    <?php $product = $this->db->table("product")->orderBy("product_name")->get();
---
SELECT *
FROM `product`
ORDER BY `product_name`