app/Views/transaction/tracking_v.php

                            <div class="col-2">
                                <select id="customer_code" name="customer_code" class="form-control select">
                                    <option value="">-- Pilih Customer --</option>
                                    <?php $customer = $this->db->table("customer")->orderBy("customer_name", "ASC")->get();
---
SELECT *
FROM `customer`
ORDER BY `customer_name` ASC

                                </thead>
                                <tbody>
                                    <?php
                                    $usr = $this->db
                                        ->table("tracking")
                                        ->join("customer", "customer.customer_code = tracking.customer_code", "left")
                                        ->where("SUBSTR(tracking_datetime,1,10) >=", $from)
                                        ->where("SUBSTR(tracking_datetime,1,10) <=", $to)
                                        ->orderBy("tracking_id", "ASC")
                                        ->get();
---
SELECT *
FROM `tracking`
LEFT JOIN `user` ON `user`.`user_id` = `tracking`.`user_id`
WHERE SUBSTR(tracking_datetime,1,10) >= '2024-12-27'
AND SUBSTR(tracking_datetime,1,10) <= '2024-12-27'
ORDER BY `tracking_id` ASC