app/Models/transaction/sewa_m.php

                    $input[$e] = $this->request->getPost($e);
                }
            }
            $this->db->table('sewa')->update($input, array("sewa_id" => $this->request->getPost("sewa_id")));
---
UPDATE `sewa` SET `sewa_tmuka` = '1', `sewa_tkanan` = '1', `sewa_tbensin` = '100', `sewa_id` = '7'
WHERE `sewa_id` = '7'