app/Controllers/api.php

INSERT INTO `marker` (`sewa_id`, `marker_latitude`, `marker_longitude`) VALUES ('9', '-6.075011000682009', '106.98545352387846')
---
    public function masukmarker()
    {
        // Inisialisasi array input untuk menyimpan data
        $input = [];
        $input["sewa_id"] = $this->request->getGet("sewa_id");
        $input["marker_latitude"] = $this->request->getGet("lat");
        $input["marker_longitude"] = $this->request->getGet("lng");

        // Cek jika input tidak kosong dan lakukan operasi insert
        if (!empty($input)) {
            $insert = $this->db->table('marker')->insert($input);