app/Views/utama_v.php

SELECT COUNT(sewa_id)AS jumlah, `sewa_date` AS `tanggal`
FROM `sewa`
WHERE `sewa`.`sewa_date` >= '2025-01-01'
AND `sewa`.`sewa_date` <= '2025-01-31'
GROUP BY `sewa_date`
---
				<?php
				$from = date("Y-m-01");
				$to = date("Y-m-t");
				$builder = $this->db
					->table("sewa")
					->select("COUNT(sewa_id)AS jumlah,sewa_date AS tanggal");

SELECT *
FROM `product`
ORDER BY `product_status` ASC, `product_name` ASC
---
										<?php
										$builder = $this->db
											->table("product");
										$usr = $builder
										->orderBy("product_status", "ASC")
										->orderBy("product_name", "ASC")
											->get();